papers/privacy/presentations/L06_supermodular/supermodular.tex
% Created 2016-10-26 Wed 16:03
\documentclass[bigger]{beamer}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{fixltx2e}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\mode<beamer>{\useinnertheme{rounded}\usecolortheme{rose}\usecolortheme{dolphin}\setbeamertemplate{navigation symbols}{}\setbeamertemplate{footline}[frame number]{}}
\mode<beamer>{\usepackage{amsmath}\usepackage{ae,aecompl} \usepackage{sgamevar}}
\usetheme{default}
\author{Christoph Schottmüller}
\date{}
\title{Game Theory: Supermodular Games\footnote{License: CC Attribution ShareAlike 4.0}}
\hypersetup{
 pdfauthor={Christoph Schottmüller},
 pdftitle={Game Theory: Supermodular Games\footnote{License: CC Attribution ShareAlike 4.0}},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 8.3.3)}, 
 pdflang={English}}
\begin{document}

\maketitle
\begin{frame}{Outline}
\tableofcontents
\end{frame}




\section{Introduction}
\label{sec:orgheadline4}

\begin{frame}[label={sec:orgheadline1}]{Motivation I}
\begin{itemize}
\item several solution concepts:
\begin{itemize}
\item (dominance)
\item rationalizability (iterative deletion of dominated strategies)
\item Nash equilibrium
\item correlated equilibrium
\end{itemize}
\item Which one to use?
\item Are there games where all solution concepts give (approximately) same prediction?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline2}]{Motivation II}
\begin{itemize}
\item comparative statics:
\begin{itemize}
\item how does the equilibrium change if one parameter changes?
\begin{itemize}
\item how do market prices depend on demand elasticity/number of firms in the market/product substitutability?
\item how will the central bank change its interest rate when unemployment rises?
\item how does campaign spending depend on media bias?
\end{itemize}
\item size of effect has to be estimated but game theoretic models can sometimes determine the sign of effect!
\item are there properties of models under which the sign of the effect is unambiguously clear?
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline3}]{Example: Search}
\begin{block}{Example: Simple search market}
\begin{itemize}
\item \(N\) traders exert effort \(x_i\) to search for other trader
\item if two traders find each other, each gets benefit 1
\item probability that trader \(i\) finds other trader is \(\min\left\{1,\alpha x_i\left( \sum_{j\neq i}x_j+\beta \right) \right\}\) where \(\alpha>0\) and \(\beta\)>0 are such that \(0<\alpha ((N-1)+\beta)<1\)
\item costs of effort are \(x_i^2\)
\end{itemize}
\end{block}
\begin{itemize}
\item Given the effort of the others, how much effort should \(i\) exert?
\item If trader \(j\) exerts more effort, how does this affect the optimal effort of \(i\)?
\item If the search technology improves, will a trader exert more or less effort?
\item Could our answers depend on the solution concept used?
\end{itemize}
\end{frame}

\section{Model}
\label{sec:orgheadline19}
\begin{frame}[label={sec:orgheadline5}]{Model Setup: Simple smooth supermodular games}
\begin{itemize}
\item \(N\) players
\item action sets \(A_i=[\underline y_i,\bar y_i]\)
\item simultaneous move game
\item utility functions: \(u_i(a_i,a_{-i})\):
\begin{itemize}
\item \(u_i\) is twice continuously differentiable
\item \(\frac{\partial^2 u_i}{\partial a_i\partial a_j}\geq 0\) for \(i\neq j\) (\(\sim\) supermodularity: this is the important assumption of today!)
\end{itemize}
\item check: Does the simple search market satisfy the assumptions?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline6}]{What are the effects of \(\frac{\partial^2 u_i}{\partial a_i\partial a_j}\geq 0\)?}
\begin{itemize}
\item "Increasing differences":                                         
\begin{itemize}
\item let \(a_1>a_1'\), then \(u_1(a_1,a_2,a_3,\dots)-u_1(a_1',a_2,a_3,\dots)=\int_{a_1'}^{a_1}\frac{\partial u_1}{\partial a_1}(x,a_2,a_3,\dots)\,dx\) is increasing in \(a_2\) because of \(\frac{\partial^2 u_1}{\partial a_1\partial a_2}\geq 0\)
\end{itemize}
\item check: verify that the \emph{simple search market} satisfies increasing differences
\end{itemize}
\begin{block}{Result}
Let \(a_i>a_i'\). If \(u_i(a_i,a_{-i})>u_i(a_i',a_{-i})\), then \(u_i(a_i,a_{-i}')>u_i(a_i',a_{-i}')\) for all \(a_{-i}'\geq a_{-i}\).     
\end{block}
\begin{itemize}
\item Roughly: Best responses are increasing.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline7}]{Serially undominated strategies (another solution concept\dots{})}
\begin{itemize}
\item same as iterative elimination of strictly dominated strategies $\backslash$\ BUT only pure strategies are used

\item Which actions of player \(i\) are \emph{not} strictly dominated by pure strategies? Call them \(A_i^1\).
\item Which actions of player \(i\) are \emph{not} strictly dominated by pure strategies if the other players play only actions from \(A_j^1\)? Call them \(A_i^2\).
\item Which actions of player \(i\) are \emph{not} strictly dominated by pure strategies if the other players play only actions from \(A_j^2\)? Call them \(A_i^3\).
\item \dots{}

\item note that \(A_i^1\supseteq A_i^2\supseteq \dots\)
\item \(U_i=A_i^1\cap A_i^2 \cap\dots\) is the set of \alert{serially undominated strategies} of player \(i\)
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline8}]{Example: serially undominated strategies}
\begin{block}{Difference between serially undominated strategies and iterative elimination of strictly dominated actions}
\begin{table}[h]
\centering
 \begin{game}{3}{3}
       \> L \> C   \>  R\\ 
T   \>6,5  \> 4,2  \> 3,3  \\
M   \>3,0   \> 3,5   \>6,1 \\
B   \>4,1   \>3,0    \>2,16  
\end{game}
\end{table}
\end{block}
\end{frame}

\begin{frame}[label={sec:orgheadline9}]{Main result}
\begin{itemize}
\item let  \(\underline u_i\) denote the minimum of \(U_i\) and  \(\bar u_i\) the maximum of \(U_i\)
\end{itemize}
\begin{theorem}[Supermodularity Result 1]
The strategy profile \((\underline u_1,\underline u_2,\dots)\) is a Nash equilibrium. The strategy profile \((\bar u_1,\bar u_2,\dots)\) is also a Nash equilibrium.
\end{theorem}
\begin{itemize}
\item Why is this important?
\begin{itemize}
\item \(U_i\) gives a range in which
\begin{itemize}
\item all rationalizable actions have to lie in (why?)
\item all Nash equilibria have to be in (why?)
\item the support of all correlated equilibria has to be in (why?)
\end{itemize}
\item if \(\underline u_i\) and \(\bar u_i\) are close, all these solution concepts give similar predictions!
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline10}]{Proof of Supermodularity Result 1}
We show that \((\underline u_1,\underline u_2,\dots)\) is NE. 
\begin{itemize}
\item Can a deviation to \(a_i'<\underline u_i\) or to \(a_i'>\bar u_i\) be profitable?
\end{itemize}

\vspace*{2cm}

\begin{itemize}
\item Can a deviation to \(a_i''\in(\underline u_i,\bar u_i]\) be profitable?\\
\end{itemize}
Suppose it was, i.e. \(u_i(a_i'',\underline u_{-i})-u_i(\underline u_i,\underline u_{-i})>0\). Then,\dots{}

\vspace*{2.5cm}

\begin{itemize}
\item Similar proof for \((\bar u_1,\bar u_2,\dots)\) (exercise) \hfill\qed
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline11}]{Extending the result}
\begin{itemize}
\item Result 1 is only useful if \(\bar u_i\) and \(\underline u_i\) are close
\begin{itemize}
\item if \(\underline u_i=\bar u_i\), then
\begin{itemize}
\item there is a unique  rationalizable action
\item which is the unique Nash equilibrum
\item which is a unique correlated equilibrium
\item the game can be solved by iterative elimination of strictly dominated strategies
\end{itemize}
\item note that result implies the following:
\end{itemize}
\end{itemize}
\begin{block}{Corollary}
If a supermodular game  either
\begin{itemize}
\item has a unique pure strategy NE or
\item is symmetric and has a unique pure strategy symmetric NE,
\end{itemize}

then each player has a unique rationalizable action and the game can be solved by iterative elimination of strictly dominated actions. 
\end{block}
(why?)
\end{frame}

\begin{frame}[label={sec:orgheadline12}]{Is the corollary useful?}
\begin{itemize}
\item Take \emph{simple search market} with 2 agents.
\begin{itemize}
\item Determine all pure strategy NE.
\item How many correlated equilibria does this game have?
\item What is the set of rationalizable actions?
\end{itemize}

\item Does the answer change if there are \(n\) agents?
\end{itemize}
\end{frame}
\begin{frame}[label={sec:orgheadline13}]{Bertrand with differentiated goods}
\begin{block}{Example: price competition}
Two firms compete by setting prices. Demand for firm \(i\) is
\(D_i(p_1,p_2)=\gamma-p_i+\beta p_j\)
with \(0<\beta< 1\) and \(\gamma>0\). Costs for firm \(i\) are \(c_i D_i(p_1,p_2)\). Both firms maximize profits.
\end{block}

\begin{itemize}
\item Is the game supermodular?
\item Does it have a unique pure strategy Nash equilibrium?
\item What are the sets of rationalizable actions and correlated equilibria?
\end{itemize}
\end{frame}


\begin{frame}[label={sec:orgheadline14}]{Comparative statics I}
\begin{itemize}
\item Now we want to ask questions like:
\begin{itemize}
\item how does the equilibrium effort in the search market change if \(\alpha\) increases?
\item how do the equilibrium prices in the Bertrand game change if \(c_i\) changes (or \(\beta\)) changes?
\end{itemize}
\item now: utility functions depend on actions and a parameter \(\tau\) \\
\end{itemize}
\(u_i(a_i,a_{-i},\tau)\)
hence, lower and upper bounds on serially undominated strategies \(\underline u_i\) and \(\bar u_i\) are functions of \(\tau\)
\begin{theorem}[Supermodularity Result 2]
If \(\frac{\partial^2 u_i}{\partial a_i\partial \tau}\geq 0\) for all \(i\), then \(\underline{u}_i\) and \(\bar u_i\) are increasing in \(\tau\).
\end{theorem}
\end{frame}

\begin{frame}[label={sec:orgheadline15}]{Comparative Statics II}
\begin{itemize}
\item result 2 is especially useful if \(\underline u_i(\tau)=\bar u_i(\tau)\)
\item check:
\begin{itemize}
\item how does the equilibrium effort in the search market depend on \(\alpha\)?
\item how do the equilibrium prices in the Bertrand game change if \(c_i\) changes (or \(\beta\)) changes?
\end{itemize}
\item idea behind result 2:
\begin{itemize}
\item assume 2 players and interior equilibrium (i.e. \(\partial u_i/\partial a_i=0\) in equilibrium)
\item assume strictly concave utility functions, i.e. \(\partial^2 u_i/\partial a_i^2<0\)
\item if \(\tau\) increases, how does this affect marginal utility \(\partial u_i/\partial a_i\)?
\item can \(a_1\) increase and \(a_2\) decrease if \(\tau\) increases?
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline16}]{"Supermodularizing": Tricks I}
\begin{block}{Example: Cournot}
Two firms with zero marginal costs set quantities \(q_i\). The resulting market price is \(1-q_1-q_2\). Firm \(i\) maximizes its profit \(q_i(1-q_i-q_j)\).
\end{block}

\begin{itemize}
\item Is this game supermodular?
\item Any idea what to do?
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline17}]{"Supermodularizing": Tricks II}
\begin{itemize}
\item We use again the price competition model but now we assume a logit demand
\end{itemize}
\(D_i(p_i,p_j)=\frac{1}{e^{p_i-p_j}+1}\)
\begin{itemize}
\item profits are then
\end{itemize}
\(\pi_i(p_i,p_j)=\frac{p_i}{e^{p_i-p_j}+1}\)
which do not satisfy \(\partial^2 \pi_i/\partial p_1\partial p_2\geq 0\)
\begin{itemize}
\item trick:
\begin{itemize}
\item the price maximizing \(\pi_i(p_i,p_j)\) is the same that maximizes \(log(\pi_i(p_i,p_j))\)
\item let firms maximize log profits \(u_i(p_i,p_j)=log (\pi_i(p_i,p_j))= log(p_i)-log(e^{p_i-p_j}+1)\) which satisfies \(\partial^2 u_i/\partial p_1\partial p_2\geq 0\) (check!)
\end{itemize}
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline18}]{Extensions}
\begin{itemize}
\item What if each player takes several actions?$\backslash$\ e.g. a firm sets price, quality and warranty length
\item \(A_i=[\underline y_i^1,\bar y_i^1]\times [\underline y_i^2,\bar y_i^2]\times \dots \times [\underline y_i^{k_i},\bar y_i^{k_i}]\)
\item hence, an action of player \(i\) is now a vector \((a_i^1,a_i^2,\dots,a_i^{k_i})\)
\item supermodularity in this setup:
\begin{itemize}
\item \(\frac{\partial^2 u_i}{\partial a_i^m \partial a_j^n}\geq 0\) for all \(i\neq j\) and \(1\leq m\leq k_i\) and \(1\leq n\leq k_j\)
\item \(\frac{\partial^2 u_i}{\partial a_i^m \partial a_i^n}\geq0\) for all \(i\) and \(1\leq m< n\leq k_i\)
\end{itemize}
\item with these assumptions all results still hold
\end{itemize}
\end{frame}


\section{Revision questions and exercises}
\label{sec:orgheadline23}

\begin{frame}[label={sec:orgheadline20}]{Revision questions}
\begin{itemize}
\item Why are we interested in supermodular games?
\item How are (simple smooth) supermodular games defined? (what is the crucial assumption?)
\item Explain the "increasing differences" property.
\item What is the main result for supermodular games? What does it imply for the case that the game has only one pure strategy Nash equilibrium?
\item What do we mean by "comparative statics" and what kind of comparative static result is special for supermodular games?
\item What kind of tricks can you use to "make a game supermodular"?
\end{itemize}

reading: Amir (2005) p.636-649; 

*reading: Milgrom and Roberts (1990) (introduction+sections 2+4)
\end{frame}

\begin{frame}[label={sec:orgheadline21}]{Exercises I}
\begin{itemize}
\item Exercise 1:
\begin{enumerate}
\item Take the standard Bertrand model with \emph{homogenous} goods: 2 firms have costs 0 and set a price \(p_i\). There is one consumer who buys from the firm with the lower price (as long as this price is below his valuation \(v\)). Is this game supermodular?
\item Choose a game theoretic model from another course you have taken and check whether the game was supermodular (or could be transformed into a supermodular model using one of the tricks).
\end{enumerate}
\item Exercise 2:\\
Complete the proof of supermodularity result 1 by showing that \((\bar u_1,\bar u_2,\dots)\) is a Nash equilibrium.
\end{itemize}
\end{frame}

\begin{frame}[label={sec:orgheadline22}]{Exercises II}
\begin{itemize}
\item *Exercise 3:\\
Assume in addition to the assumptions so far that \(u_i\) is strictly concave: \(\partial^2 u_i/\partial a_i^2<0\). Show that each \(A_i^k\) (in the iterative elimination of dominated actions) is an interval and conclude that \(U_i\) is an interval.
\end{itemize}
\end{frame}
\end{document}